<!DOCTYPE html>
<html>
<head>
  <meta charset='utf-8'>
  <meta http-equiv="X-UA-Compatible" content="chrome=1">
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />
  <link href='http://fonts.googleapis.com/css?family=Noto+Sans' rel='stylesheet' type='text/css'/>
  <link href="http://netdna.bootstrapcdn.com/font-awesome/3.2.1/css/font-awesome.min.css" rel="stylesheet" />
  <link rel="stylesheet" type="text/css" href="stylesheets/stylesheet.css" media="screen" />
  <link rel="stylesheet" type="text/css" href="stylesheets/pygment_trac.css" media="screen" />
  <link rel="stylesheet" type="text/css" href="stylesheets/print.css" media="print" />
  <link rel="icon" href="images/favicon.ico" />

    <!--[if lt IE 9]>
    <script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <title>Code &amp; Cuisine by EpokK</title>
  </head>

  <body ng-app="myApp">
    <header>
      <div class="inner">
        <h1>Code &amp; Cuisine</h1>
      </div>
      <a href="https://github.com/EpokK" target="_blank"><img style="position: absolute; top: 0; right: 0; border: 0;" src="https://s3.amazonaws.com/github/ribbons/forkme_right_gray_6d6d6d.png" alt="Fork me on GitHub"></a>
    </header>

    <div id="content-wrapper" ng-controller="myCtrl">
      <div class="inner clearfix">
        <section id="main-content">
          <h2 ng-click="a4.show=!a4.show">Ractive.js : Alternative &agrave; AngularJS <i ng-class="{'icon-collapse-top': a4.show==false, 'icon-collapse': a4.show==true}"></i></h2>
          <article ng-show="a4.show==true">
            <p>Quelqu'un a os&eacute; ? Concurrencer Google sur son propre terrain ! Mais bien s&ucirc;r et il existe plusieurs MVC Javascript bien connus apparus bien avant. BackboneJS par exemple ou encore le <i>rongeur</i> EmberJS. Dans cet article je ne souhaite pas vous pr&eacute;senter ces frameworks mais une <i>librairie</i> qui permet de manipuler le DOM autrement, comme le fais AngularJS.</p>
            <p>D&egrave;s le depart HTML n'a jamais &eacute;t&eacute; con&ccedil;u pour cr&eacute;er des applications Web dynamiques. Des librairies tel que jQuery ou PrototypeJS ont grandement facilit&eacute;es l'utilisation de Javascript pour rendre vos pages <i>cool</i>. Il est alors facile de recuperer un element de votre page en JS et lui ajouter toute sorte d'event / function / boule a facette ... La librairie que je souhaite vous presenter permet de garder une relation / liaison forte entre votre code Javascript et la structure HTML. Ce dernier devient alors un <i>mod&egrave;le</i> pour votre application.</p>
            <p>Rien de mieux qu'un <i>"Bye World"</i> pour commencer (oai j'essaye d'innover pour pas te perdre)</p>
            HTML
            http://plnkr.co/edit/QBce9kNC8PozcciPGUlw
          </article>

          <h2 ng-click="a3.show=!a3.show">Quelques directives Angular <i ng-class="{'icon-collapse-top': a3.show==false, 'icon-collapse': a3.show==true}"></i></h2>
          <article ng-show="a3.show==true">
            <p>Depuis quelques mois, j'ai la chance de travailler avec un framework JS que je trouve formidable. Il se nomme <strong>AngularJS</strong>. Je ne vais pas vous le pr&eacute;senter car bien d'autres sites l'ont d&eacute;ja fait. Si vous ne le connaissez pas encore je vous conseille vivement d'aller taper quelques lignes de code avec ce framework avant de lire la suite de cet article. Comme &ccedil;a apres, "t'es chaud" !</p>
            <p>Ce que je souhaite partager, ce sont les <i>directives</i>. Une directive est un attribut, d'un &eacute;l&eacute;ment HTML, qui lui octroi des fonctionnalit&eacute;s suppl&eacute;mentaires : tel que lancer une action quand on clique sur celui-ci ou encore, r&eacute;p&eacute;ter cet element autant de fois qu'il y a d'objet dans un tableau associ&eacute;. AngularJS fourni d&eacute;ja un ensemble de directives pour effectuer la plupart des actions / interactions. Il s'enrichie au fur et &agrave; mesure des versions. Malgr&eacute; ce packetage, il faut parfois en &eacute;crire soi-m&ecirc;me. Et comme ce besoin peut &ecirc;tre r&eacute;current &agrave; travers vos projets, il est int&eacute;ressant de se cr&eacute;er une boite &agrave; directives.</p>
            <p>Voici celles que j'utilise r&eacute;guli&egrave;rement :</p>
            <ul>
              <li><a href="#" ng-click="a3.gist=1">ng-focus</a></li>
              <li><a href="#" ng-click="a3.gist=2">ng-blur</a></li>
              <li><a href="#" ng-click="a3.gist=3">ng-rightClick</a></li>
              <li><a href="#" ng-click="a3.gist=4">ng-enter</a></li>
              <li><a href="#" ng-click="a3.gist=5">ng-initFocus</a></li>
              <li><a href="#" ng-click="a3.gist=6">ng-datePicker</a></li>
              <li><a href="#" ng-click="a3.gist=7">ng-placeholder</a></li>
            </ul>

            <div ng-switch on="a3.gist">
              <div ng-switch-when="1"><script src="https://gist.github.com/EpokK/6044633.js"></script></div>
              <div ng-switch-when="2"><script src="https://gist.github.com/EpokK/5787597.js"></script></div>
              <div ng-switch-when="3"><script src="https://gist.github.com/EpokK/6029276.js"></script></div>
              <div ng-switch-when="4"><script src="https://gist.github.com/EpokK/5884263.js"></script></div>
              <div ng-switch-when="5"><script src="https://gist.github.com/EpokK/5857181.js"></script></div>
              <div ng-switch-when="6"><script src="https://gist.github.com/EpokK/6038227.js"></script></div>
              <div ng-switch-when="7"><script src="https://gist.github.com/EpokK/5884029.js"></script></div>
            </div>

            <p>Si vous souhaitez en ajouter d'autres, fa&icirc;tes des <i>pull request</i> sur <a href="https://github.com/EpokK/epokk.github.io" target="_blank">ce projet</a>. J'enrichirai cet article par la suite.</p>
          </article>

          <h2 ng-click="a2=!a2">Ma configuration pour Sublime Text <i ng-class="{'icon-collapse-top': a2==false, 'icon-collapse': a2==true}"></i></h2>
          <article ng-show="a2==true">
            <p>Petit d&eacute;ja tu aimais l'informatique (dans une cave), tu jouais aux jeux videos avec tes potes et tu essayais de comprendre quelques lignes de codes. Maintenant tu les comprends ces lignes, tu as grandis dans cet univers. C'est bien. Tu as debut&eacute; en &eacute;ditant tes premiers fichiers avec vim, gedit ou encore notepad. Puis sont apparus des IDE avanc&eacute;s tel que : Eclispe, Netbeans ou encore Aptana. Tu y a go&ucirc;t&eacute;, mais au fur et &agrave; mesure de son utilisation, tu sentais que quelque chose t'&eacute;chappais. Tu te sentais frustr&eacute;, faible pour avoir suivi les conseils d'un coll&egrave;gue binoclar aux cheveux longs. Ce c&ocirc;t&eacute; simple et limite que possedaient tes premiers editeurs. Tu as peut-&ecirc;tre bascul&eacute; sur Notepad++, par la suite, le trouvant &agrave; ton go&ucirc;t ou m&ecirc;me, tu as compris que le d&eacute;veloppement n'&eacute;tais pas fait pour toi et vends des calle&ccedil;ons / strings de couleur sur les march&eacute;s. Mais tout &ccedil;a c'est fini !</p>
            <img width="100%" src="images/sublime.png" alt="Sublime Text">
            <p>Si tu ne le sais pas encore, nous sommes en 2013 et un &eacute;diteur de d&eacute;veloppement est sorti, il se nomme Sublime Text. Il a connu un engo&ucirc;ement aupres des d&eacute;veloppeurs avec la version 2. Cet &eacute;diteur de texte est cod&eacute; en C++ / Python par Jon Skinner et il est disponible sous toutes les plateformes (Mac, Linux et Windows). Pour tout ce qui est de l'installation (Package Control et autres plugins kikoolol) je te laisse trouver cel&agrave; sur les Internetz. Ce que je veux te pr&eacute;senter ici dans cet article, c'est ma configuration. Tu peux la copier dans ton fichier de configuration () et te la peter. Je te laisse le choix &eacute;galement du color_scheme m&ecirc;me si j'appr&eacute;cie actuellement l'excellent "Tomorrow".</p>
            <pre><code>
{
  "caret_style": "phase",
  "detect_slow_plugins": false,
  "draw_minimap_border": true,
  "font_face": "Source Code Pro",
  "font_size": 16,
  "highlight_line": true,
  "ignored_packages":
  [
    "Vintage"
  ],
  "margin": 0,
  "trim_trailing_white_space_on_save": true
}
            </code></pre>
            <p>Tu peux t&eacute;l&eacute;charger l'excellente police "Source Code Pro" ici : https://github.com/adobe/source-code-pro</p>
            <p>Le color_scheme "Tomorrow" et le th&egrave;me "Phoenix" sont disponibles via Package Control.</p>
            <p>Sublime Text est sorti en version 3 mais tous les plugins n'ont pas encore &eacute;t&eacute; transf&eacute;r&eacute;s dessus. Voici <a href="https://github.com/wbond/sublime_package_control/wiki/Sublime-Text-3-Compatible-Packages" target="_blank">la liste de ceux disponibles</a>.</p>
          </article>

          <h2 ng-click="a1=!a1">Le BOLD, c'est la vie <i ng-class="{'icon-collapse-top': a1==false, 'icon-collapse': a1==true}"></i></h2>
          <article ng-show="a1==true">
            <img width="100%" src="images/karadocperceval.jpg" alt="Karadoc et Perceval">
            <p>Coder dans une cave a l'abri du soleil c'est bien mais il faut aussi savoir se ressourcer. Je ne compte pas te pr&eacute;senter la recette du riz au coca-cola ou autre malbouffe. Ici tu lis le blog de quelqu'un qui aime se faire chier, qui aime se prendre la t&ecirc;te et faire les choses bien. Donc comme premier essai je te pr&eacute;sente ma recette <strong>Cr&ecirc;pe oignons champignons</strong>. R&eacute;gales toi et impressionnes ta copine ou ta m&egrave;re.</p>
            <h4>Ingr&eacute;dients</h4>
            <ul>
              <li>Huile d'olive</li>
              <li>Du vinaigre balsamic</li>
              <li>2 gros oignons</li>
              <li>Un paquet de tortillas (par 8 en general, au pire &ccedil;a t'en fera plus pour en emporter au boulot et te la p&eacute;ter devant tes collegues qui mangent leur barquette plastique Fleury Mich Mich)</li>
              <li>Des champignons frais (tu peux aller les chercher en for&ecirc;t en suivant les vieux qui s'&eacute;garent dans les bois ou acheter une conserve; je privil&eacute;gie la premi&egrave;re solution sinon tu es pas un vrai !)</li>
              <li>Du gruy&egrave;re rap&eacute;</li>
              <li>Du persil</li>
              <li>Le couple sel et poivre</li>
              <li>Une grosse salade verte (que tu n'auras pas achet&eacute; en sachet pour &eacute;viter que tes enfants soient roux, "Il faut cr&eacute;er des l&eacute;gendes pour &eacute;duquer la populace")</li>
            </ul>
            <p>Avec 2 cuiller&eacute;es &agrave; soupe d'huile d'olive faire fondre les oignons que tu auras pr&eacute;c&eacute;dement coup&eacute;s en tout petit morceaux (fais toi chier, &ccedil;a vaut le coup). Ajoutes une cuiller &agrave; caf&eacute; de sucre pour les faire carameliser pendant 3 min puis les r&eacute;server. Effectuer cette m&ecirc;me &eacute;tape avec les champignons.</p>
            <p>Dans ta po&ecirc;le IKEA, dispose une premi&egrave;re tortilla et fais la revenir 1 min, puis ajoute ton m&eacute;lange oignons / champignons. Pars&egrave;mes le tout de fromage rap&eacute;.</p>
            <p>Les deux &eacute;tapes pr&eacute;c&eacute;dentes sont &agrave; r&eacute;p&eacute;ter autant de fois que tu as d'invit&eacute;. Exemple : tu re&ccedil;ois tes parents dans ta cave, &ccedil;a fait trois personnes (donc tu dois r&eacute;p&eacute;ter encore deux fois les op&eacute;rations pr&eacute;c&eacute;dentes).</p>
            <p>Sers les croustillants aux oignons et champignons avec la salade que tu arroses g&eacute;n&eacute;reusement de vinaigre balsamique et d'huile d'olive.</p>
            <p>Pour montrer que tu n'es pas parfait &agrave; tes h&ocirc;tes, tu peux rajouter au dernier moment des pignons de pains ou des &eacute;clats de noix (d&eacute;cortiqu&eacute;es) en disant : "Mince j'avais oubli&eacute; ceci !"</p>
            <p>R&eacute;gales toi !</p>
          </article>
        </section>

        <aside id="sidebar">
          <div><a style="font-size: 24px;" target="_blank" href="https://twitter.com/_PandaJS"><i class="icon-twitter"></i> Follow me</a></div>
          <div><a style="font-size: 24px;" target="_blank" href="https://github.com/EpokK"><i class="icon-github-sign"></i> Fork me</a></div>
          <div><a style="font-size: 24px;" target="_blank" href="https://gist.github.com/EpokK"><i class="icon-github"></i> Gist me</a></div>
          <div><a style="font-size: 24px;" target="_blank" href="http://stackoverflow.com/users/1875004/epokk"><i class="icon-stackexchange"></i> Help me</a></div>
          <hr />
          <p><strong>Qui suis-je ?</strong></p>
          <div><img style="border-radius: 5px;border: 5px solid #CCC;margin: 10px auto;display: block;" src="images/panda.png" alt="Panda"></div>
          <p>Front End Developer @infomaniak - Fan de #HTML5, #CSS3, @AngularJS, @BackboneJS, #ResponsiveDesign, @yeoman et autres technos bien cools. "Hardcore devlopper / cooker", constamment en recherche de connaissances sur le d&eacute;veloppement web et d&eacute;couvertes culinaires. J'aime ce qui est ordonn&eacute; et bien fait / pens&eacute;, j'appr&eacute;cie egalement les choses limites / restrictives car je consid&egrave;re que les meilleurs projets sont souvent les plus simples.</p>
          <p><strong>Pour qui et pourquoi ce blog ?</strong></p>
          <p>Si tu en as marre de cette societe de mou du genoux,</p>
          <ul>
            <li>Qui pense a facilite et vacation.</li>
            <li>Qui achete des surgeles et qui repete a longueur de journee "Je suis stresse, j'ai pas le temps".</li>
            <li>Qui se laisse bercer par les medias et autres idiocies.</li>
            <li>Qui regarde son nombril et ne se remet jamais en question.</li>
          </ul>
          <p>Ce blog est fait pour toi !</p>
          <p>J'ecris ce blog pour partager mes decouvertes et connaissances que ce soit en programmation ou en cuisine et tout ce que je trouve interessant. Je tape en QWERTY ce qui explique qu'il n'y est pas d'accent dans mes articles (et ceux qui sont pr&eacute;sent sont corrig&eacute;s par <a href="http://www.twitter.com/netvision73">@netvision73</a>. Tous commentaires doit se faire par <a href="https://github.com/EpokK/epokk.github.io" target="_blank">le projet Github</a> lui m&ecirc;me en faisant des <i>pull request</i>. Il est m&ecirc;me possible de corriger mes fautes d'orthographe si tu commences &agrave; avoir les yeux <span style="color: red;">rouges</span>.</p>
        </aside>
      </div>
    </div>

    <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/angularjs/1.0.7/angular.min.js"></script>
    <script type="text/javascript">
      myApp = angular.module("myApp",[]);
      myApp.controller("myCtrl", function($scope){
        $scope.a1 = true;
        $scope.a2 = true;
        $scope.a3 = {
          show: true,
          gist: 1
        }
        $scope.a4 = {
          show: true
        }
      });
    </script>
    <script>
      (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

      ga('create', 'UA-42577530-1', 'epokk.github.io');
      ga('send', 'pageview');
    </script>
  </body>
</html>
