<img width="100%" src="../images/karadocperceval.jpg" alt="Karadoc et Perceval">
<p>Coder dans une cave a l'abri du soleil c'est bien mais il faut aussi savoir se ressourcer. Je ne compte pas te pr&eacute;senter la recette du riz au coca-cola ou autre malbouffe. Ici tu lis le blog de quelqu'un qui aime se faire chier, qui aime se prendre la t&ecirc;te et faire les choses bien. Donc comme premier essai je te pr&eacute;sente ma recette <strong>Cr&ecirc;pe oignons champignons</strong>. R&eacute;gales toi et impressionnes ta copine ou ta m&egrave;re.</p>
<h4>Ingr&eacute;dients</h4>
<ul>
  <li>Huile d'olive</li>
  <li>Du vinaigre balsamic</li>
  <li>2 gros oignons</li>
  <li>Un paquet de tortillas (par 8 en general, au pire &ccedil;a t'en fera plus pour en emporter au boulot et te la p&eacute;ter devant tes collegues qui mangent leur barquette plastique Fleury Mich Mich)</li>
  <li>Des champignons frais (tu peux aller les chercher en for&ecirc;t en suivant les vieux qui s'&eacute;garent dans les bois ou acheter une conserve; je privil&eacute;gie la premi&egrave;re solution sinon tu es pas un vrai !)</li>
  <li>Du gruy&egrave;re rap&eacute;</li>
  <li>Du persil</li>
  <li>Le couple sel et poivre</li>
  <li>Une grosse salade verte (que tu n'auras pas achet&eacute; en sachet pour &eacute;viter que tes enfants soient roux, "Il faut cr&eacute;er des l&eacute;gendes pour &eacute;duquer la populace")</li>
</ul>
<p>Avec 2 cuiller&eacute;es &agrave; soupe d'huile d'olive faire fondre les oignons que tu auras pr&eacute;c&eacute;dement coup&eacute;s en tout petit morceaux (fais toi chier, &ccedil;a vaut le coup). Ajoutes une cuiller &agrave; caf&eacute; de sucre pour les faire carameliser pendant 3 min puis les r&eacute;server. Effectuer cette m&ecirc;me &eacute;tape avec les champignons.</p>
<p>Dans ta po&ecirc;le IKEA, dispose une premi&egrave;re tortilla et fais la revenir 1 min, puis ajoute ton m&eacute;lange oignons / champignons. Pars&egrave;mes le tout de fromage rap&eacute;.</p>
<p>Les deux &eacute;tapes pr&eacute;c&eacute;dentes sont &agrave; r&eacute;p&eacute;ter autant de fois que tu as d'invit&eacute;. Exemple : tu re&ccedil;ois tes parents dans ta cave, &ccedil;a fait trois personnes (donc tu dois r&eacute;p&eacute;ter encore deux fois les op&eacute;rations pr&eacute;c&eacute;dentes).</p>
<p>Sers les croustillants aux oignons et champignons avec la salade que tu arroses g&eacute;n&eacute;reusement de vinaigre balsamique et d'huile d'olive.</p>
<p>Pour montrer que tu n'es pas parfait &agrave; tes h&ocirc;tes, tu peux rajouter au dernier moment des pignons de pains ou des &eacute;clats de noix (d&eacute;cortiqu&eacute;es) en disant : "Mince j'avais oubli&eacute; ceci !"</p>
<p>R&eacute;gales toi !</p>