<p>Petit d&eacute;ja tu aimais l'informatique (dans une cave), tu jouais aux jeux videos avec tes potes et tu essayais de comprendre quelques lignes de codes. Maintenant tu les comprends ces lignes, tu as grandis dans cet univers. C'est bien. Tu as debut&eacute; en &eacute;ditant tes premiers fichiers avec vim, gedit ou encore notepad. Puis sont apparus des IDE avanc&eacute;s tel que : Eclispe, Netbeans ou encore Aptana. Tu y a go&ucirc;t&eacute;, mais au fur et &agrave; mesure de son utilisation, tu sentais que quelque chose t'&eacute;chappais. Tu te sentais frustr&eacute;, faible pour avoir suivi les conseils d'un coll&egrave;gue binoclar aux cheveux longs. Ce c&ocirc;t&eacute; simple et limite que possedaient tes premiers editeurs. Tu as peut-&ecirc;tre bascul&eacute; sur Notepad++, par la suite, le trouvant &agrave; ton go&ucirc;t ou m&ecirc;me, tu as compris que le d&eacute;veloppement n'&eacute;tais pas fait pour toi et vends des calle&ccedil;ons / strings de couleur sur les march&eacute;s. Mais tout &ccedil;a c'est fini !</p>
<img width="100%" src="images/sublime.png" alt="Sublime Text">
<p>Si tu ne le sais pas encore, nous sommes en 2013 et un &eacute;diteur de d&eacute;veloppement est sorti, il se nomme Sublime Text. Il a connu un engo&ucirc;ement aupres des d&eacute;veloppeurs avec la version 2. Cet &eacute;diteur de texte est cod&eacute; en C++ / Python par Jon Skinner et il est disponible sous toutes les plateformes (Mac, Linux et Windows). Pour tout ce qui est de l'installation (Package Control et autres plugins kikoolol) je te laisse trouver cel&agrave; sur les Internetz. Ce que je veux te pr&eacute;senter ici dans cet article, c'est ma configuration. Tu peux la copier dans ton fichier de configuration () et te la peter. Je te laisse le choix &eacute;galement du color_scheme m&ecirc;me si j'appr&eacute;cie actuellement l'excellent "Tomorrow".</p>
<pre><code class="json">
{
  "caret_style": "phase",
  "detect_slow_plugins": false,
  "draw_minimap_border": true,
  "font_face": "Source Code Pro",
  "font_size": 16,
  "highlight_line": true,
  "ignored_packages":
  [
  "Vintage"
  ],
  "margin": 0,
  "trim_trailing_white_space_on_save": true
}
</code></pre>
<p>Tu peux t&eacute;l&eacute;charger l'excellente police "Source Code Pro" ici : https://github.com/adobe/source-code-pro</p>
<p>Le color_scheme "Tomorrow" et le th&egrave;me "Phoenix" sont disponibles via Package Control.</p>
<p>Sublime Text est sorti en version 3 mais tous les plugins n'ont pas encore &eacute;t&eacute; transf&eacute;r&eacute;s dessus. Voici <a href="https://github.com/wbond/sublime_package_control/wiki/Sublime-Text-3-Compatible-Packages" target="_blank">la liste de ceux disponibles</a>.</p>