<img src="images/carbone.png" alt="Carbone">
<p>"Pff tu vas rien m'apprendre, je fais des p&acirc;tes carbo depuis que ma m&egrave;re me laisse cuisiner". C'est ce que tu te dis, et tu as tort. Dans ton studio d'&eacute;tudiant tu draguais d&eacute;ja avec ce plat, la miss n'osait pas te dire que c'etait ... d&eacute;gueux, trop gras, tu ajoutais de la cr&egrave;me fra&icirc;che, des lardons en plastique et sortais des p&acirc;tes trop cuites. &Agrave; la fin tu as eu a peine un b&eacute;co et tu n'as pas compris ... Moi je vais te dire pourquoi, car tu &eacute;tais un noob. Oui c'est vrai, mais maintenant tu veux reprendre les choses en main, r&eacute;-inviter cette demoiselle et re-tenter ta chance !</p>
<p>Avant toute chose il faut conna&icirc;tre l'origine de cette recette pour mieux la comprendre, mieux la r&eacute;aliser. Cette recette est d'origine italienne. Les mamas romaines cuisinaient ce plat aux mineurs pour qu'ils survivent a la durete de leur m&eacute;tier. "Carbonara", "Carbo", "Carbone", pour la couleur noir que donnera le poivre sur ton plat et qui rappelera le charbon (carbone).</p>
<ul>
  <li>1 oeuf par personne + 1 pour le plat (si vous &ecirc;tes deux &ccedil;a fait donc trois oeufs)</li>
  <li>de la joue de porc (pas des lardons, t'es plus un noob) ou du speck</li>
  <li>du poivre gris</li>
  <li>du gros sel</li>
  <li>200gr de spaghetti par personne de marque italienne de pr&eacute;ference</li>
  <li>1 gros morceau de parmigiano</li>
</ul>
<p>Dans une gros r&eacute;cipient, faire bouillir de l'eau. Lorsque celle-ci boue, lance une grosse poign&eacute;e de sel dedans et une dans ton dos (&ccedil;a porte chance et &ccedil;a fait chier ta meuf qui te bouche l'&eacute;vier / la douche avec ses cheveux). Place d&eacute;licatement tes spaghetti dans l'eau et laisse les cuir 1 min de moins que ce qui est indiqu&eacute; sur ton paquet.</p>
<p>Pendant ce temps, lance Super Meat Boy, non surtout pas. Coupe en grossier morceaux la joue de porc que tu auras achet&eacute; chez ton boucher; oai prends le temps d'aller chez lui, ses tarifs sont g&eacute;n&eacute;ralement comp&eacute;titif &agrave; ceux de Carrefour / Leclerc / Casino et &agrave; force d'y aller il t'offrira de la bidoche ! De plus &ccedil;a te fait conna&icirc;tre / travailler ton quartier et &ccedil;a fait bien chier les vieux de voir des jeunes prendre soin d'eux. Fais revenir la joue de porc dans une poele en veillant &agrave; ce qu'elle ne br&ucirc;le pas.</p>
<p>Dans un BOULE m&eacute;lange vigoureusement (la branlette &ccedil;a sert) les jaunes d'oeufs avec trois pinc&eacute;es de poivres. Il faut que ta composition mousse. Rajoute deux cuillers &agrave; soupe du bouillon venant de l'eau de tes p&acirc;tes pour rendre le plat moins sec.</p>
<p>Une fois tes p&acirc;tes cuites, &eacute;goutte-les et d&eacute;verse le contenu de ton BOULE. Dresses m&eacute;ticuleusement ton assiette (creuse) avec une grosse poign&eacute;e de p&acirc;te et r&eacute;partis les morceaux de viande. Par dessus, r&acirc;pes du parmesan et sers tes assiettes.</p>
<p>R&eacute;gales toi !</p>